export const versionList = [{
    version: '20210210_01_test',
    desc: '第一个带版本号的版本, 完善个人突破, 料理屋挑战可配置点击连续挑战x次后结束脚本。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_01_test',
    desc: '寮突破完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_02_test',
    desc: '个人突破增加打呱适配, 增加悬浮中选择方案后可直接启动脚本（需手动启用）',
}, {
    version: '20210212_01_test',
    desc: '个人探索基本完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_01_test',
    desc: '1.增加结束脚本功能，结束条件请在该功能中进行修改。\n2.优化探索挑战\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_02_test',
    desc: '新增准备功能中可配置在准备界面退出，增加个人突破降级方案。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210320_01',
    desc: '无障碍和悬浮权限修改为手动获取，开启后才能正常使用脚本'
}, {
    version: '20210322_01',
    desc: '新增地鬼日常'
}, {
    version: '20210324_01',
    desc: '新增百鬼夜行'
}, {
    version: '20210328_01',
    desc: '新增关联启动应用，在设置界面关联应用后通过功能列表点击启动后会根据关联的应用自动启动，若关联多个应用会在启动的时候进行提示，友好多渠道阴阳师玩家'
}, {
    version: '20210331_01',
    desc: '新增抽厕纸'
}, {
    version: '20210404_01',
    desc: '新增逢魔密信答题，需要使用完整的壳程序和安装Ocr-AjPlugin.apk插件才能使用，逢魔相关的其它功能正在开发中'
}, {
    version: '20210405_01',
    desc: '新增组队狗粮。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210407_01',
    desc: '新增逢魔日常方案及相关功能，\n为确保正常使用, 请在设置中重置方案及功能, 并安装插件Ocr-AjPlugin.apk'
}, {
    version: '20210424_01',
    desc: '关于项目中补充qq群信息，欢迎加入qq群: 864842180'
}, {
    version: '20210505_01',
    desc: '初步支持方案间的切换，见[例]方案中的配置，为确保正常使用, 请在设置中重置方案及功能'
}, {
    version: '20210515_01',
    desc: '新增寮突破CD支持切换方案, 寮突破进攻CD可配置检测频率, 寮突破翻页达到一定次数后可停止脚本/切换方案'
}, {
    version: '20210516_01',
    desc: '修复[结界_进攻]功能中寮突破CD的时间单位异常问题，请修改过单位为毫秒数值的同学再次把单位修改为秒对应的数值，若无法修改或出现异常停止的情况请重置方案与功能'
}, {
    version: '20210525_01',
    desc: '新增组队自动匹配功能，需要先手动总一遍流程，保证打开主页面组队的时候是需要自动匹配的项目，例如妖气等'
}, {
    version: '20210604_01',
    desc: '新增[活动]天魔归来'
}, {
    version: '20210605_01',
    desc: '解决[活动]天魔归来boss战退出结算后点击到奖励说明后无法继续的问题'
}, {
    version: '20210608_01',
    desc: '给各功能增加详细的描述'
}, {
    version: '20210609_01',
    desc: '新增准备后自动绿标，需要将被标记的式神别名为“A”'
}, {
    version: '20210612_01',
    desc: '新增继续育成，解放双手5红喂1蓝'
}, {
    version: '20210621_01',
    desc: '永生之海组队支持'
}, {
    version: '20210623_01',
    desc: '新增换狗粮对上N卡的支持'
}, {
    version: '20210708_01',
    desc: '新增呱太活动适配，新增从庭院进入探索地图(方案个人探索请手动开启功能29或在设置中重置方案与功能后更新方案)'
}, {
    version: '20210722_01',
    desc: '新增适配活动往复之间'
}, {
    version: '20210821_01',
    desc: '优化探索: 领取宝箱，减少妖气、石距对探索章节的影响'
}, {
    version: '20210825_01',
    desc: '新增：自动斗技'
}, {
    version: '20210829_01',
    desc: '新增：可配置停止脚本时使用推送加(https://pushplus.hxtrip.com)推送当前状态'
}, {
    version: '20210830_01',
    desc: '新增: 结界卡_继续育成'
}, {
    version: '20210922_01',
    desc: '新增：5周年活动平安美食祭-集市挑战'
}, {
    version: '20210922_02',
    desc: '新增：道馆'
}, {
    version: '20211119_01',
    desc: '修复地鬼日常热门挑战错误问题，修复地鬼退出结算时进入分享界面导致卡住的问题，优化地鬼日常根据已挑战内容决定剩下挑战次数。'
}, {
    version: '20211121_01',
    desc: '新增根据当前界面智能识别场景并启动脚本'
}, {
    version: '20211124_01',
    desc: '优化自动识别速度，新增真实之羽_清月竹林活动。'
}, {
    version: '20211128_01',
    desc: '新增准备功能自定义坐标绿标'
}, {
    version: '20211204_01',
    desc: '新增月临之时挑战'
}, {
    version: '20211218_01',
    desc: '修复自动匹配（妖气封印）的bug'
}, {
    version: '20211229_01',
    desc: '新增夜影诡谈挑战，请重置脚本后食用'
}, {
    version: '20220112_01',
    desc: '因2021.1.12日更新导致部分功能失效，本次更新复以下功能: \n准备功能: 无法准备、手动状态时无法切自动;\n地鬼热门挑战功能: 选择热门标签时错误。'
}, {
    version: '20220115_01',
    desc: '修复切换方案失效，修复部分场景手动无法切自动，修复逢魔答题报错'
}, {
    version: '20220119_01',
    desc: '修复：退出结算计次异常的问题；优化：探索时自动勾选自动轮换。'
}, {
    version: '20220124_01',
    desc: '新增：脚本暂停，在功能0结束判断中进行配置；\n优化：退出结算时的坐标点击范围'
}, {
    version: '20220129_01',
    desc: '新增：行为仿真，默认不启用，有需要的同学请手动启用'
}, {
    version: '20220130_01',
    desc: '修复：继续育成',
}, {
    version: '20220202_01',
    desc: '新增：停止脚本自动关闭已关联应用'
}, {
    version: '20220227_01',
    desc: '修复：体服退出结算卡在已经打开的达摩的界面'
}, {
    version: '20220319_01',
    desc: '修复：探索boss不点的问题\n优化：新增探索划屏速度可修改；\n优化：新增点击模式可配置\n；优化：功能执行计次不够准确的问题'
}, {
    version: '20220320_01',
    desc: '修复：滑动时偶现报错的问题'
}, {
    version: '20220323_01',
    desc: '新增：伊吹之擂，资源不够多的小伙伴慎用'
}, {
    version: '20220324_01',
    desc: '修复：伊吹之擂可能会随机放弃御魂的问题、伊吹之擂可能卡结算的问题'
}, {
    version: '20224060_01',
    desc: '尝试修复：退出结算时点击到奖励物品导致卡住的问题'
}, {
    version: '20220502_01',
    desc: '修复：退出结算可能点击分享的问题；\n优化：调试绘制；\n优化：百鬼夜行增加撒豆模式可选；\n优化：个人御魂御灵等点击挑战增加停止机制；\n优化：个人探索进入28章判定可能存在的问题；\n优化：地鬼挑战判断可能存在的问题。'
}, {
    version: '20220503_01',
    desc: '优化：探索挑战时速度过快的情况，稍微降低判断速度；\n尝试修复：退出探索时可能会退出至庭院的问题。'
}, {
    version: '20220503_02',
    desc: '优化：新增寮突破cd的可随机等待时间'
}, {
    version: '20220518_01',
    desc: '新增：活动方案战场巡逻；\n优化：功能0中的toast提示修改为底部对齐'
}, {
    version: '20220522_01',
    desc: '新增：活动方案战场挑战'
}, {
    version: '20220522_02',
    desc: '新增：镰鼬百战自动挑战15次'
}, {
    version: '20220525_01',
    desc: '新增：活动功能战场巡逻_挑战支持二阶段蛇魔挑战'
}, {
    version: '20220525_02',
    desc: '新增：活动方案前线作战'
}, {
    version: '20220526_01',
    desc: '修复：活动功能战场巡逻二阶段蛇魔挑战10次后不打的bug'
}, {
    version: '20220528_01',
    desc: '修复：前线作战庭院不进入的问题；\n新增：终焉降临挑战，使用战场巡逻即可'
}, {
    version: '20220529_01',
    desc: '新增：活动功能战场巡逻杂项，目前功能为终焉决战分数大于5500w分时自动退出，请手动开启'
}, {
    version: '20220529_02',
    desc: '新增：秘闻_挑战支持妖刀姬竞速'
}, {
    version: '20220622_01',
    desc: '新增：活动方案与功能：不朽之木_三途轮回'
}, {
    version: '20220622_02',
    desc: '修复：行为仿真打开守护频道后卡住的问题'
}, {
    version: '20220625_01',
    desc: '新增：探索支持打掉落加成'
}, {
    version: '20220709_01',
    desc: '新增：悬赏封印、金币妖怪、宴会。感谢aiou大佬的鼎力支持！'
}, {
    version: '20220710_01',
    desc: '优化：使用YunxiOcr(paddle)代替浩然OCR，且扩展由外置apk修改为程序内置，但需进入设置页面打开OCR扩展并下载'
}, {
    version: '20220716_01',
    desc: '优化：个人突破、寮突破的进攻按钮的查找逻辑'
}, {
    version: '20220717_01',
    desc: '尝试修复：突破进攻部分设备不识别的情况'
}, {
    version: '20220722_01',
    desc: '新增：功能百妖之巅挑战'
}, {
    version: '20220724_01',
    desc: '优化：原金币妖怪_关闭buff为关闭BUFF，增加关闭BUFF后切换方案；\n新增：关闭BUFF方案，可从大部分界面退出至探索地图界面并关闭BUFF'
}, {
    version: '20220724_02',
    desc: '修复：宴会问题，由aiou大佬提交'
}, {
    version: '20220729_01',
    desc: '新增：活动方案流火之擂'
}, {
    version: '20220730_01',
    desc: '新增：活动方案红叶行狩'
}, {
    version: '20220730_02',
    desc: '尝试修复：突破勋章点击点到头像的问题'
}, {
    version: '20220731_01',
    desc: '修复：庭院进入探索地图功能在部分失效的问题；\n修复：红叶行狩中选择祝福时左边的点击区域错误问题；\n修复：红叶行狩第三名卡结束的问题；新增：导出方案。'
}, {
    version: '20220731_02',
    desc: '新增：导入方案，已知剪切板共享长度可能受限，粘贴时需注意是否粘贴完整；\n修复：红叶行狩选择骰子时若“2”已经选过导致的界面不识别的问题'
}, {
    version: '20220805_01',
    desc: '新增：准备功能中绿标支持自定义文本，使用OCR进行文字识别后点击式神'
}, {
    version: '20220806_01',
    desc: '新增：开启BUFF功能'
}, {
    version: '20220807_01',
    desc: '优化：绿标由原来的准备功能修改为独立功能，并在绿标前判断是否绿标，剔除原来的标A，使用固定坐标或固定文本进行标记'
}, {
    version: '20220808_01',
    desc: '优化：绿标可在增加准备阶段时开始查找，需手动开启；增加战斗匹配机制进行绿标：战斗场次变更（基于由脚本执行的退出结算）后首次绿标时无需判断场内是否有绿标'
}, {
    version: '20220820_01',
    desc: '新增：爬塔活动梦境徊游'
}, {
    version: '20220820_02',
    desc: '新增：答题活动梦旅竞速'
}, {
    version: '20220821_1',
    desc: '新增：庭院打开悬赏界面方案（id52），用于其他方案转悬赏方案，如金币妖怪，由aiou大佬提交'
}, {
    version: '20220826_1',
    desc: '优化：答题活动优化题库'
}, {
    version: '20220911_1',
    desc: '修复：因界面变化导致地鬼热门挑战功能功能失效'
}, {
    version: '20220920_01',
    desc: '新增：活动风暴试炼'
}, {
    version: '20220921_01',
    desc: '修复：适配999活动和探索地图界面变化'
}, {
    version: '20220921_02',
    desc: '修复：999活动结算时获得奖励确认在只有一排奖励时不点的问题（功能24）'
}, {
    version: '20220921_03',
    desc: '修复：探索选怪挑战界面无法识别的问题'
}, {
    version: '20220923_01',
    desc: '优化：999活动挑战连续3次未开始停止脚本中提高两次之间的延时至3秒'
}, {
    version: '20221001_01',
    desc: '修复：适配探索地图界面变化'
}, {
    version: '20221009_01',
    desc: '新增：定时任务；\n新增：结界寄养\n功能由@horsemi提供，感谢大佬的支持'
}, {
    version: '20221012_01',
    desc: '优化：结界寄养等相关功能'
}, {
    version: '20221015_01',
    desc: '修复：悬赏重复执行时中途停止的问题；\n修复：部分功能无法识别庭院与探索地图界面；\n修复：伊吹之擂'
}, {
    version: '20221022_01',
    desc: '优化：修复登录页识别失败问题，添加对一打开菜单的庭院识别；\n优化：式神寄养添加自动寄养开关'
}, {
    version: '20221024_01',
    desc: '优化：修复式神寄养无法识别第二个可用坑位，添加返回庭院方案；\n优化：优化登录方案，添加关闭广告功能；\n修复：式神寄养无法识别第二个可用坑位；\n新增：返回庭院方案。'
}, {
    version: '20221029_01',
    desc: '优化：区域点击的随机坐标生成更加更人性化，且不同设备的偏向坐标不同'
}, {
    version: '20221031_01',
    desc: '新增：qq推送机器人osp上线，使用方法见https://zzliux.cn/assttyys-osp-usage/'
}, {
    version: '20221103_01',
    desc: '优化：已有功能中只要包含脚本停止的内容均可通过osp进行推送'
}, {
    version: '20221109_01',
    desc: '优化：地鬼打完后退出至探索地图界面；\n优化：进入探索地图界面功能中新增从组队界面退出的操作（针对关闭buff方案在组队打完后不会进行任何操作进行优化）'
}, {
    version: '20221110_01',
    desc: '修复：因ui变化导致的金币妖怪与悬赏运行时的部分功能执行异常问题，由aiou大佬提交'
}, {
    version: '20221115_01',
    desc: '新增：狩猎战、道馆挑战方案（horsemi大佬提交）；\n优化：式神寄养，延长响应时间（horsemi大佬提交）；\n新增：六道萤草'
}, {
    version: '20221115_02',
    desc: '优化：六道萤草装buff时偶尔出现点不上的情况增加重试机制，选buff时刷新体验'
}, {
    version: '20221115_03',
    desc: '优化：六道萤草4buff齐后再装buff等'
}, {
    version: '20221117_01',
    desc: '优化：六道萤草：新增统计与推送'
}, {
    version: '20221119_01',
    desc: '优化：使用官方MlkitOcr代替YunxiOcr，优化兼容性与识别性能（需更新壳程序）；\n优化：式神寄养添加关联应用关闭功能。\n'
}, {
    version: '20221119_02',
    desc: '优化：六道萤草各场景延时，提高整体连贯性'
}, {
    version: '20221120_01',
    desc: '修复：六道萤草挂机局数设置为0时只打一局的bug'
}, {
    version: '20221122_01',
    desc: '优化：六道萤草增加宁息商店购买buff，需开启ocr扩展，启用功能206'
}, {
    version: '20221123_01',
    desc: '优化：六道萤草宁息够买buff由ocr识别修改为多点找色；\n修复：六道萤草选buff只刷新一次就直接选buff的bug'
}, {
    version: '20221125_01',
    desc: '新增：活动方案化四季_小怪、化四季boss'
}, {
    version: '20221130_01',
    desc: '修复：探索因UI界面变化导致功能失效的问题'
}, {
    version: '20221130_02',
    desc: '优化：六道萤草选buff支持修改选择buff的优先级（仅能修改内置优先级）；\n优化：适配六道萤草宁息刷新的二次确认；\n优化：六道萤草增加进入装buff界面的延迟'
}, {
    version: '20221202_01',
    desc: '尝试修复：六道萤草不装buff的bug'
}, {
    version: '20221203_01',
    desc: '尝试修复：六道萤草开新局时计数与计次不重置的问题'
}, {
    version: '20221204_01',
    desc: '尝试修复：六道萤草不装buff的bug'
}, {
    version: '20221204_02',
    desc: '尝试修复：六道萤草开新局时计数与计次不重置的问题'
}, {
    version: '20221208_01',
    desc: '修复：调整式神寄养方案，寮活动方案与登录方案，适配新版本（horsemi）'
}, {
    version: '20221210_01',
    desc: '代码重构：请及时反馈使用问题！！'
}, {
    version: '20221210_02',
    desc: '修复：ocr无法使用的问题；\n修复：部分功能无法配置；\n优化：保存方案后自动设置为待运行方案'
}, {
    version: '20221210_03',
    desc: '新增：退出结算可配置再次进攻；\n新增：9退4的突破卡级方案'
}, {
    version: '20221210_04',
    desc: '新增：夜行荒河活动耗时挂机'
}, {
    version: '20221211_01',
    desc: '修复：定时任务不运行方案的bug'
}, {
    version: '20221211_02',
    desc: '新增：悬浮截图按钮'
}, {
    version: '20221213_01',
    desc: '修复：修复全局变量没清空问题；\n优化：狩猎战方案；\n优化：支持多个调度任务同时启用'
}, {
    version: '20221215_01',
    desc: '新增：六道萤草_唤息，老用户需手动开启，将207排序在204前；\n优化：六道萤草_选buff时若xx加成大于等于两个时不刷新（省金币）'
}, {
    version: '20221221_01',
    desc: '新增：活动方案`镜守云归_雪寺匿踪`；\n尝试修复：探索不打boss'
}, {
    version: '20221222_01',
    desc: '修复：御魂御灵挑战无法挑战觉醒的问题；\n修复：镜活动卡结算的问题'
}, {
    version: '20221223_01',
    desc: '修复：六道萤草唤息会点两次的问题'
}, {
    version: '20221227_01',
    desc: '新增：六道萤草极评分时自动使用万相赐福'
}, {
    version: '20221228_01',
    desc: '新增：破魔伏诛挑战'
}, {
    version: '20221229_01',
    desc: '修复：功能502进入探索地图界面中御魂与觉醒界面无法退出来的bug'
}, {
    version: '20230104_01',
    desc: '优化：逢魔新增首领挑战功能（老用户需手动启用）；\n修复：结界寄养部分bug'
}, {
    version: '20230105_01',
    desc: '优化：重构调度任务'
}, {
    version: '20230107_01',
    desc: '优化：绿标在准备前若未识别到别名不会强行卡着无法准备(5秒超时)；\n优化：绿标在查找文本时先进行战斗场景的判断，解决战斗完成后因绿标查找浪费时间；\n优化：六道萤草选buff界面增加500ms的二次判断；\n优化：宁息界面由300ms的二次判断增加至1000ms；\n优化：唤息时先判断是否有宁息，在没有宁息的前提下才会唤息；\n优化：自动任务持久化，不用每次启动程序后手动打开自动任务。'
}, {
    version: '20230114_01',
    desc: '优化：寄养翻页逻辑，加快过滤速度；\n修复：寮突破未加载完成时翻页问题；\n优化：调度任务中切换方案不触发调度任务的结束，直到手动/自动停止才触发调度任务的结束',
}, {
    version: '20230116_01',
    desc: '新增：切换式神预设方案；\n优化：地鬼挑战自动转为普通模式；\n优化：结界寄养适配问题。',
}, {
    version: '20230117_01',
    desc: '新增：月烬宵宴_伴星歌方案；\n优化：寮活动中添加对当天活动的判断行为；\n优化：调度任务超过30分钟后不执行'
}, {
    version: '20230128_01',
    desc: '新增：月烬宵宴_伪月落方案；\n优化：方案页增加分组筛选'
}, {
    version: '20230128_02',
    desc: '优化：功能页、定时任务页中的方案选择器增加分组筛选'
}, {
    version: '20230130_01',
    desc: '新增：寮活动退治、阴界之门、狭间暗域；\n新增：抢寮预祝；\n修复：逢魔boss结算时点击头像问题；\n优化：结界寄养翻页后点错结界卡的问题；\n优化：登录时无响应点击等待'
}, {
    version: '20230204_01',
    desc: '优化：调度任务添加优先级逻辑；\n修复：狭间暗域关闭弹窗的问题'
}, {
    version: '20230205_01',
    desc: '优化：悬赏与金币妖怪部分界面重新取色，优化识别'
}, {
    version: '20230207_01',
    desc: '优化：悬赏与金币妖怪部分界面重新取色，优化识别',
}, {
    version: '20230207_02',
    desc: '修复：收藏/取消方案时会导致该方案重置的问题'
}, {
    version: '20230210_01',
    desc: '新增：喂猫喂狗方案；\n新增：调度任务支持cron表达式配置；\n优化：式神寄养时自动领取奖励；\n'
}, {
    version: '20230211_01',
    desc: '修复：调度任务使用cron时的问题；\n优化：宴会改版适配（摆烂）;\n优化：喂猫喂狗适配'
}, {
    version: '20230212_01',
    desc: `优化：探索时不强制打开轮换；
优化：探索的打掉落加成增加色组，优化识别率；
优化：绿标文本时点击的坐标稍微下移几个像素；
优化：退出结算点击区域调整（仅针对左上角贪吃鬼图标场景调整）；
优化：道馆挑战时点击挑战图标时增加1秒的等待防止点击过早弹出排名列表；
优化：宴会增加轮换配置逻辑；
优化：狭间暗域打首领与小怪的优先级
`
}, {
    version: '20230213_01',
    desc: `修复: 阴阳寮获取体力金币bug；`
}, {
    version: '20230213_02',
    desc: `修复：御魂挑战在战斗界面时触发3次停止脚本；
优化：退出结算时将贪吃鬼图标的优先级提到最高；
优化：御魂挑战喂猫增加适配。
`
}, {
    version: '20230215_01',
    desc: `新增：贪食鬼吃御魂方案；
新增：奉纳御魂。
`
}, {
    version: '20230215_02',
    desc: '修复：游戏更新导致准备功能无法从手动切换为自动'
}, {
    version: '20230216_01',
    desc: `新增：从式神录进入御魂界面；
优化：“突破_9退4_进攻”可识别到攻打第一排第一列结界则切换方案；
优化：隐藏了历史活动`
}, {
    version: '20230219_01',
    desc: '优化：六道莹草buff统计使用获得奖励界面统计（手选buff与开箱子buff均能统计进来了），需启用208'
}, {
    version: '20230219_02',
    desc: '修复：退出结算使用左上角贪吃鬼图标判时的计次错误的问题'
}, {
    version: '20230220_01',
    desc: `优化：拆分寮活动方案逻辑，添加拆分后的定时任务与方案`
}, {
    version: '20230221_01',
    desc: `新增：“奉纳结束后会返回式神录”
新增：“绘卷进度检测”方案。
新增：“2_退出结算”功能加入识别体力不足。
修复：奉纳御魂osp推送。
优化：“503_返回庭院界面”可从式神录界面返回
优化：悬浮按钮的主页键删除。
`
}, {
    version: '20230221_02',
    desc: '修复：“9 结界_勋章点击”运行报错的问题。'
}, {
    version: '20230223_01',
    desc: `尝试修复：退出结算时点击到加成的问题；
优化：“502_进入探索地图界面”中组队邀请确认可点击取消`
}, {
    version: '20230223_02',
    desc: '修复：修改方案名、排序等操作会重置已修改过的方案的问题'
}, {
    version: '20230223_03',
    desc: `新增：活动方案鬼城岐事及相关功能；
优化：夜行荒河适配本次活动`
}, {
    version: '20230225_01',
    desc: '优化：重置方案支持重置单个方案（仅内置方案）'
}, {
    version: '20230226_01',
    desc: `新增：306邀请好友功能；
优化：27组队匹配修改为组队创建队伍或匹配
优化：501打开buff界面支持从组队界面内打开
优化：4接受邀请支持切换方案`
}, {
    version: '20230227_01',
    desc: `优化/修复：304绘卷检测问题
修复：接受邀请导致退出结算计数异常的问题`
}, {
    version: '20230301_01',
    desc: '新增：活动方案决裂庭院'
}, {
    version: '20230303_01',
    desc: `优化：CRON定时任务逻辑修改：表达式用于解析下次运行时间，调度时根据下次运行时间进行判定，请使用CRON表达式定时任务的同学手动编辑一下重复间隔用于重新解析下次运行时间；
尝试修复：个人突破点头像的问题；
新增：内置组队循环示例方案
`
}, {
    version: '20230304_01',
    desc: `修复：个人突破报错的问题
新增：庭院进入斗技、探索地图进入每周挑战秘闻功能
优化：开启buff简化配置`
}, {
    version: '20230304_02',
    desc: `优化：悬赏进入副本识别，应该不会打睡猪8了，如果还有碰到进入高难度机制本请截图反馈，加大庭院打开悬赏弹窗的识别范围，可以使用高个子式神了
修复：庭院悬赏弹窗在所有任务完成的情况下卡在弹窗那里。现在庭院悬赏弹窗页面如果所有任务已经完成会关闭弹窗后停止脚本，也可在42功能里设置执行下一个方案`
}, {
    version: '20230305_01',
    desc: `新增：3悬赏支持仅接勾协
优化：302奉纳支持三排的神眷`
}, {
    version: '20230306_01',
    desc: `尝试修复：个人突破点头像的问题；
尝试修复：不接勾协的问题；
优化：功能993取消包名配置，修改为读取设置中的关联应用`
}, {
    version: '20230306_02',
    desc: `优化：52悬赏_打开悬赏界面支持与完整的悬赏方案一起使用而不冲突（放在功能29前），原功能不受影响
优化：52兼容悬赏图标“√”时打开悬赏界面
优化：48悬赏杂项支持刷新记录提示的关闭`
}, {
    version: '20230308_01',
    desc: `妇女节快乐！！😘😘😘 优化：个人突破支持呱太；
优化：调度任务修改为10秒获取一次调度状态；CRON定时任务在启动程序时自动更新下次运行时间；
优化：式神寄养流程；
修复：寮活动空对象访问。
`
}, {
    version: '20230308_02',
    desc: `优化：六道萤草装buff时重置按钮增加延迟`
}, {
    version: '20220310_01',
    desc: '新增：强化御魂方案'
}, {
    version: '20220310_02',
    desc: `优化：呱太突破增加色组提高兼容性；
优化：强化御魂可选x号位`
}, {
    version: '20230312_01',
    desc: `优化：庭院进入探索低画质适配；
优化：寄养翻页；
优化：添加悬赏定时任务；
优化：脚本停止时的提示内容包含已执行的方案。`
}, {
    version: '20230312_02',
    desc: '优化：悬赏兼容左上角有“拓”或“宠”的情况'
}, {
    version: '20230314_01',
    desc: `新增：310暴食鬼吃经验书；
优化：309强化御魂当页结束后修改为翻页，而不是退出重进；
优化：30斗技支持到指定段位后停止脚本；
优化：27创建组队时默认选择不公开；
优化：203六道萤草在挑战boss失败后放弃挑战
修复：306组队邀请好友在识别不出好友时报错的问题；
修复：52悬赏“√”识别不到的问题；
修复：43悬赏神秘妖怪报错的问题。
`
}, {
    version: '20230315_01',
    desc: '优化：进入逢魔，斗技方式，找色调整为多点比色，添加首领进入式神录适配'
}, {
    version: '20230321_01',
    desc: `优化：51绿标勾选准备时查找坐标时，固定坐标也同时生效；
优化：993启动游戏前判断是否庭院，如果是庭院则不启动游戏并直接进行后续逻辑
`
}, {
    version: '20230329_01',
    desc: `优化：添加红标功能，优化公告适配，添加活动 万言归灵方案，优化调度中心，减短补锅时长`
}, {
    version: '20230401_01',
    desc: `优化：27创建组队在体力不够时自动停止（点击3次未开始）
优化：7结界3次刷新cd判定时间从30秒修改为5秒
`
}, {
    version: '20230401_02',
    desc: `优化：突破点头像 
优化：组队方案可以被悬浮窗按钮识别
优化：单人探索BUG
优化：组队邀请BUG
增加：每周百鬼奕
增加：言灵对弈活动
`
}, {
    version: '20230403_01',
    desc: `修复：突破0勋章持续点击 
优化：探索退出延时增加
`
}, {
    version: '20230401_03',
    desc: `修复：突破勋章点击(如任无法识别可更改找色为96)`
}, {
    version: '20230404_01',
    desc: '修复：cron调度任务跨月时间更新错误/未更新的问题'
}, {
    version: '20230405_01',
    desc: '新增：众言归一活动'
}, {
    version: '20230405_02',
    desc: '优化：多点找色相关色组修改对齐方向'
}];

export default versionList[versionList.length - 1].version;