export const versionList = [{
    version: '20210210_01_test',
    desc: '第一个带版本号的版本, 完善个人突破, 料理屋挑战可配置点击连续挑战x次后结束脚本。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_01_test',
    desc: '寮突破完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_02_test',
    desc: '个人突破增加打呱适配, 增加悬浮中选择方案后可直接启动脚本（需手动启用）',
}, {
    version: '20210212_01_test',
    desc: '个人探索基本完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_01_test',
    desc: '1.增加结束脚本功能，结束条件请在该功能中进行修改。\n2.优化探索挑战\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_02_test',
    desc: '新增准备功能中可配置在准备界面退出，增加个人突破降级方案。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210320_01',
    desc: '无障碍和悬浮权限修改为手动获取，开启后才能正常使用脚本'
}, {
    version: '20210322_01',
    desc: '新增地鬼日常'
}, {
    version: '20210324_01',
    desc: '新增百鬼夜行'
}, {
    version: '20210328_01',
    desc: '新增关联启动应用，在设置界面关联应用后通过功能列表点击启动后会根据关联的应用自动启动，若关联多个应用会在启动的时候进行提示，友好多渠道阴阳师玩家'
}, {
    version: '20210331_01',
    desc: '新增抽厕纸'
}];

export default versionList[versionList.length - 1].version;