export const versionList = [{
    version: '20210210_01_test',
    desc: '第一个带版本号的版本, 完善个人突破, 料理屋挑战可配置点击连续挑战x次后结束脚本。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_01_test',
    desc: '寮突破完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210211_02_test',
    desc: '个人突破增加打呱适配, 增加悬浮中选择方案后可直接启动脚本（需手动启用）',
}, {
    version: '20210212_01_test',
    desc: '个人探索基本完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_01_test',
    desc: '1.增加结束脚本功能，结束条件请在该功能中进行修改。\n2.优化探索挑战\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210217_02_test',
    desc: '新增准备功能中可配置在准备界面退出，增加个人突破降级方案。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210320_01',
    desc: '无障碍和悬浮权限修改为手动获取，开启后才能正常使用脚本'
}, {
    version: '20210322_01',
    desc: '新增地鬼日常'
}, {
    version: '20210324_01',
    desc: '新增百鬼夜行'
}, {
    version: '20210328_01',
    desc: '新增关联启动应用，在设置界面关联应用后通过功能列表点击启动后会根据关联的应用自动启动，若关联多个应用会在启动的时候进行提示，友好多渠道阴阳师玩家'
}, {
    version: '20210331_01',
    desc: '新增抽厕纸'
}, {
    version: '20210404_01',
    desc: '新增逢魔密信答题，需要使用完整的壳程序和安装Ocr-AjPlugin.apk插件才能使用，逢魔相关的其它功能正在开发中'
}, {
    version: '20210405_01',
    desc: '新增组队狗粮。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
    version: '20210407_01',
    desc: '新增逢魔日常方案及相关功能，\n为确保正常使用, 请在设置中重置方案及功能, 并安装插件Ocr-AjPlugin.apk'
}, {
    version: '20210424_01',
    desc: '关于项目中补充qq群信息，欢迎加入qq群: 864842180' 
}, {
    version: '20210505_01',
    desc: '初步支持方案间的切换，见[例]方案中的配置，为确保正常使用, 请在设置中重置方案及功能'
}, {
    version: '20210515_01',
    desc: '新增寮突破CD支持切换方案, 寮突破进攻CD可配置检测频率, 寮突破翻页达到一定次数后可停止脚本/切换方案'
}, {
    version: '20210516_01',
    desc: '修复[结界_进攻]功能中寮突破CD的时间单位异常问题，请修改过单位为毫秒数值的同学再次把单位修改为秒对应的数值，若无法修改或出现异常停止的情况请重置方案与功能'
}, {
    version: '20210525_01',
    desc: '新增组队自动匹配功能，需要先手动总一遍流程，保证打开主页面组队的时候是需要自动匹配的项目，例如妖气等'
}, {
    version: '20210604_01',
    desc: '新增[活动]天魔归来'
}, {
    version: '20210605_01',
    desc: '解决[活动]天魔归来boss战退出结算后点击到奖励说明后无法继续的问题'
}, {
    version: '20210608_01',
    desc: '给各功能增加详细的描述'
}, {
    version: '20210609_01',
    desc: '新增准备后自动绿标，需要将被标记的式神别名为“A”'
}, {
    version: '20210612_01',
    desc: '新增继续育成，解放双手5红喂1蓝'
}, {
    version: '20210621_01',
    desc: '永生之海组队支持'
}, {
    version: '20210623_01',
    desc: '新增换狗粮对上N卡的支持'
}, {
    version: '20210708_01',
    desc: '新增呱太活动适配，新增从庭院进入探索地图(方案个人探索请手动开启功能29或在设置中重置方案与功能后更新方案)'
}, {
    version: '20210722_01',
    desc: '新增适配活动往复之间'
}, {
    version: '20210821_01',
    desc: '优化探索: 领取宝箱，减少妖气、石距对探索章节的影响'
}, {
    version: '20210825_01',
    desc: '新增：自动斗技'
}, {
    version: '20210829_01',
    desc: '新增：可配置停止脚本时使用推送加(https://pushplus.hxtrip.com)推送当前状态'
}, {
    version: '20210830_01',
    desc: '新增: 结界卡_继续育成'
}, {
    version: '20210922_01',
    desc: '新增：5周年活动平安美食祭-集市挑战'
}, {
    version: '20210922_02',
    desc: '新增：道馆'
}, {
    version: '20211119_01',
    desc: '修复地鬼日常热门挑战错误问题，修复地鬼退出结算时进入分享界面导致卡住的问题，优化地鬼日常根据已挑战内容决定剩下挑战次数。'
}, {
    version: '20211121_01',
    desc: '新增根据当前界面智能识别场景并启动脚本'
}, {
    version: '20211124_01',
    desc: '优化自动识别速度，新增真实之羽_清月竹林活动。'
}, {
    version: '20211128_01',
    desc: '新增准备功能自定义坐标绿标'
}, {
    version: '20211204_01',
    desc: '新增月临之时挑战'
}, {
    version: '20211218_01',
    desc: '修复自动匹配（妖气封印）的bug'
}, {
    version: '20211229_01',
    desc: '新增夜影诡谈挑战，请重置脚本后食用'
}, {
    version: '20220112_01',
    desc: '因2021.1.12日更新导致部分功能失效，本次更新复以下功能: \n准备功能: 无法准备、手动状态时无法切自动;\n地鬼热门挑战功能: 选择热门标签时错误。'
}, {
    version: '20220115_01',
    desc: '修复切换方案失效，修复部分场景手动无法切自动，修复逢魔答题报错'
}, {
    version: '20220119_01',
    desc: '修复：退出结算计次异常的问题；优化：探索时自动勾选自动轮换。'
}, {
    version: '20220124_01',
    desc: '新增：脚本暂停，在功能0结束判断中进行配置；\n优化：退出结算时的坐标点击范围'
}, {
    version: '20220129_01',
    desc: '新增：行为仿真，默认不启用，有需要的同学请手动启用'
}, {
    version: '20220130_01',
    desc: '修复：继续育成',
}, {
    version: '20220202_01',
    desc: '新增：停止脚本自动关闭已关联应用'
}, {
    version: '20220227_01',
    desc: '修复：体服退出结算卡在已经打开的达摩的界面'
}];

export default versionList[versionList.length - 1].version;