export const versionList = [{
	version: '20210210_01_test',
	desc: '第一个带版本号的版本, 完善个人突破, 料理屋挑战可配置点击连续挑战x次后结束脚本。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210211_01_test',
	desc: '寮突破完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210211_02_test',
	desc: '个人突破增加打呱适配, 增加悬浮中选择方案后可直接启动脚本（需手动启用）',
}, {
	version: '20210212_01_test',
	desc: '个人探索基本完善。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210217_01_test',
	desc: '1.增加结束脚本功能，结束条件请在该功能中进行修改。\n2.优化探索挑战\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210217_02_test',
	desc: '新增准备功能中可配置在准备界面退出，增加个人突破降级方案。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210320_01',
	desc: '无障碍和悬浮权限修改为手动获取，开启后才能正常使用脚本'
}, {
	version: '20210322_01',
	desc: '新增地鬼日常'
}, {
	version: '20210324_01',
	desc: '新增百鬼夜行'
}, {
	version: '20210328_01',
	desc: '新增关联启动应用，在设置界面关联应用后通过功能列表点击启动后会根据关联的应用自动启动，若关联多个应用会在启动的时候进行提示，友好多渠道阴阳师玩家'
}, {
	version: '20210331_01',
	desc: '新增抽厕纸'
}, {
	version: '20210404_01',
	desc: '新增逢魔密信答题，需要使用完整的壳程序和安装Ocr-AjPlugin.apk插件才能使用，逢魔相关的其它功能正在开发中'
}, {
	version: '20210405_01',
	desc: '新增组队狗粮。\n为确保正常使用, 请在设置中重置方案及功能',
}, {
	version: '20210407_01',
	desc: '新增逢魔日常方案及相关功能，\n为确保正常使用, 请在设置中重置方案及功能, 并安装插件Ocr-AjPlugin.apk'
}, {
	version: '20210424_01',
	desc: '关于项目中补充qq群信息，欢迎加入qq群: 864842180'
}, {
	version: '20210505_01',
	desc: '初步支持方案间的切换，见[例]方案中的配置，为确保正常使用, 请在设置中重置方案及功能'
}, {
	version: '20210515_01',
	desc: '新增寮突破CD支持切换方案, 寮突破进攻CD可配置检测频率, 寮突破翻页达到一定次数后可停止脚本/切换方案'
}, {
	version: '20210516_01',
	desc: '修复[结界_进攻]功能中寮突破CD的时间单位异常问题，请修改过单位为毫秒数值的同学再次把单位修改为秒对应的数值，若无法修改或出现异常停止的情况请重置方案与功能'
}, {
	version: '20210525_01',
	desc: '新增组队自动匹配功能，需要先手动总一遍流程，保证打开主页面组队的时候是需要自动匹配的项目，例如妖气等'
}, {
	version: '20210604_01',
	desc: '新增[活动]天魔归来'
}, {
	version: '20210605_01',
	desc: '解决[活动]天魔归来boss战退出结算后点击到奖励说明后无法继续的问题'
}, {
	version: '20210608_01',
	desc: '给各功能增加详细的描述'
}, {
	version: '20210609_01',
	desc: '新增准备后自动绿标，需要将被标记的式神别名为“A”'
}, {
	version: '20210612_01',
	desc: '新增继续育成，解放双手5红喂1蓝'
}, {
	version: '20210621_01',
	desc: '永生之海组队支持'
}, {
	version: '20210623_01',
	desc: '新增换狗粮对上N卡的支持'
}, {
	version: '20210708_01',
	desc: '新增呱太活动适配，新增从庭院进入探索地图(方案个人探索请手动开启功能29或在设置中重置方案与功能后更新方案)'
}, {
	version: '20210722_01',
	desc: '新增适配活动往复之间'
}, {
	version: '20210821_01',
	desc: '优化探索: 领取宝箱，减少妖气、石距对探索章节的影响'
}, {
	version: '20210825_01',
	desc: '新增：自动斗技'
}, {
	version: '20210829_01',
	desc: '新增：可配置停止脚本时使用推送加(https://pushplus.hxtrip.com)推送当前状态'
}, {
	version: '20210830_01',
	desc: '新增: 结界卡_继续育成'
}, {
	version: '20210922_01',
	desc: '新增：5周年活动平安美食祭-集市挑战'
}, {
	version: '20210922_02',
	desc: '新增：道馆'
}, {
	version: '20211119_01',
	desc: '修复地鬼日常热门挑战错误问题，修复地鬼退出结算时进入分享界面导致卡住的问题，优化地鬼日常根据已挑战内容决定剩下挑战次数。'
}, {
	version: '20211121_01',
	desc: '新增根据当前界面智能识别场景并启动脚本'
}, {
	version: '20211124_01',
	desc: '优化自动识别速度，新增真实之羽_清月竹林活动。'
}, {
	version: '20211128_01',
	desc: '新增准备功能自定义坐标绿标'
}, {
	version: '20211204_01',
	desc: '新增月临之时挑战'
}, {
	version: '20211218_01',
	desc: '修复自动匹配（妖气封印）的bug'
}, {
	version: '20211229_01',
	desc: '新增夜影诡谈挑战，请重置脚本后食用'
}, {
	version: '20220112_01',
	desc: '因2021.1.12日更新导致部分功能失效，本次更新复以下功能: \n准备功能: 无法准备、手动状态时无法切自动;\n地鬼热门挑战功能: 选择热门标签时错误。'
}, {
	version: '20220115_01',
	desc: '修复切换方案失效，修复部分场景手动无法切自动，修复逢魔答题报错'
}, {
	version: '20220119_01',
	desc: '修复：退出结算计次异常的问题；优化：探索时自动勾选自动轮换。'
}, {
	version: '20220124_01',
	desc: '新增：脚本暂停，在功能0结束判断中进行配置；\n优化：退出结算时的坐标点击范围'
}, {
	version: '20220129_01',
	desc: '新增：行为仿真，默认不启用，有需要的同学请手动启用'
}, {
	version: '20220130_01',
	desc: '修复：继续育成',
}, {
	version: '20220202_01',
	desc: '新增：停止脚本自动关闭已关联应用'
}, {
	version: '20220227_01',
	desc: '修复：体服退出结算卡在已经打开的达摩的界面'
}, {
	version: '20220319_01',
	desc: '修复：探索boss不点的问题\n优化：新增探索划屏速度可修改；\n优化：新增点击模式可配置\n；优化：功能执行计次不够准确的问题'
}, {
	version: '20220320_01',
	desc: '修复：滑动时偶现报错的问题'
}, {
	version: '20220323_01',
	desc: '新增：伊吹之擂，资源不够多的小伙伴慎用'
}, {
	version: '20220324_01',
	desc: '修复：伊吹之擂可能会随机放弃御魂的问题、伊吹之擂可能卡结算的问题'
}, {
	version: '20224060_01',
	desc: '尝试修复：退出结算时点击到奖励物品导致卡住的问题'
}, {
	version: '20220502_01',
	desc: '修复：退出结算可能点击分享的问题；\n优化：调试绘制；\n优化：百鬼夜行增加撒豆模式可选；\n优化：个人御魂御灵等点击挑战增加停止机制；\n优化：个人探索进入28章判定可能存在的问题；\n优化：地鬼挑战判断可能存在的问题。'
}, {
	version: '20220503_01',
	desc: '优化：探索挑战时速度过快的情况，稍微降低判断速度；\n尝试修复：退出探索时可能会退出至庭院的问题。'
}, {
	version: '20220503_02',
	desc: '优化：新增寮突破cd的可随机等待时间'
}, {
	version: '20220518_01',
	desc: '新增：活动方案战场巡逻；\n优化：功能0中的toast提示修改为底部对齐'
}, {
	version: '20220522_01',
	desc: '新增：活动方案战场挑战'
}, {
	version: '20220522_02',
	desc: '新增：镰鼬百战自动挑战15次'
}, {
	version: '20220525_01',
	desc: '新增：活动功能战场巡逻_挑战支持二阶段蛇魔挑战'
}, {
	version: '20220525_02',
	desc: '新增：活动方案前线作战'
}, {
	version: '20220526_01',
	desc: '修复：活动功能战场巡逻二阶段蛇魔挑战10次后不打的bug'
}, {
	version: '20220528_01',
	desc: '修复：前线作战庭院不进入的问题；\n新增：终焉降临挑战，使用战场巡逻即可'
}, {
	version: '20220529_01',
	desc: '新增：活动功能战场巡逻杂项，目前功能为终焉决战分数大于5500w分时自动退出，请手动开启'
}, {
	version: '20220529_02',
	desc: '新增：秘闻_挑战支持妖刀姬竞速'
}, {
	version: '20220622_01',
	desc: '新增：活动方案与功能：不朽之木_三途轮回'
}, {
	version: '20220622_02',
	desc: '修复：行为仿真打开守护频道后卡住的问题'
}, {
	version: '20220625_01',
	desc: '新增：探索支持打掉落加成'
}, {
	version: '20220709_01',
	desc: '新增：悬赏封印、金币妖怪、宴会。感谢aiou大佬的鼎力支持！'
}, {
	version: '20220710_01',
	desc: '优化：使用YunxiOcr(paddle)代替浩然OCR，且扩展由外置apk修改为程序内置，但需进入设置页面打开OCR扩展并下载'
}, {
	version: '20220716_01',
	desc: '优化：个人突破、寮突破的进攻按钮的查找逻辑'
}, {
	version: '20220717_01',
	desc: '尝试修复：突破进攻部分设备不识别的情况'
}, {
	version: '20220722_01',
	desc: '新增：功能百妖之巅挑战'
}, {
	version: '20220724_01',
	desc: '优化：原金币妖怪_关闭buff为关闭BUFF，增加关闭BUFF后切换方案；\n新增：关闭BUFF方案，可从大部分界面退出至探索地图界面并关闭BUFF'
}, {
	version: '20220724_02',
	desc: '修复：宴会问题，由aiou大佬提交'
}, {
	version: '20220729_01',
	desc: '新增：活动方案流火之擂'
}, {
	version: '20220730_01',
	desc: '新增：活动方案红叶行狩'
}, {
	version: '20220730_02',
	desc: '尝试修复：突破勋章点击点到头像的问题'
}, {
	version: '20220731_01',
	desc: '修复：庭院进入探索地图功能在部分失效的问题；\n修复：红叶行狩中选择祝福时左边的点击区域错误问题；\n修复：红叶行狩第三名卡结束的问题；新增：导出方案。'
}, {
	version: '20220731_02',
	desc: '新增：导入方案，已知剪切板共享长度可能受限，粘贴时需注意是否粘贴完整；\n修复：红叶行狩选择骰子时若“2”已经选过导致的界面不识别的问题'
}, {
	version: '20220805_01',
	desc: '新增：准备功能中绿标支持自定义文本，使用OCR进行文字识别后点击式神'
}, {
	version: '20220806_01',
	desc: '新增：开启BUFF功能'
}, {
	version: '20220807_01',
	desc: '优化：绿标由原来的准备功能修改为独立功能，并在绿标前判断是否绿标，剔除原来的标A，使用固定坐标或固定文本进行标记'
}, {
	version: '20220808_01',
	desc: '优化：绿标可在增加准备阶段时开始查找，需手动开启；增加战斗匹配机制进行绿标：战斗场次变更（基于由脚本执行的退出结算）后首次绿标时无需判断场内是否有绿标'
}, {
	version: '20220820_01',
	desc: '新增：爬塔活动梦境徊游'
}, {
	version: '20220820_02',
	desc: '新增：答题活动梦旅竞速'
}, {
	version: '20220821_1',
	desc: '新增：庭院打开悬赏界面方案（id52），用于其他方案转悬赏方案，如金币妖怪，由aiou大佬提交'
}, {
	version: '20220826_1',
	desc: '优化：答题活动优化题库'
}, {
	version: '20220911_1',
	desc: '修复：因界面变化导致地鬼热门挑战功能功能失效'
}, {
	version: '20220920_01',
	desc: '新增：活动风暴试炼'
}, {
	version: '20220921_01',
	desc: '修复：适配999活动和探索地图界面变化'
}, {
	version: '20220921_02',
	desc: '修复：999活动结算时获得奖励确认在只有一排奖励时不点的问题（功能24）'
}, {
	version: '20220921_03',
	desc: '修复：探索选怪挑战界面无法识别的问题'
}, {
	version: '20220923_01',
	desc: '优化：999活动挑战连续3次未开始停止脚本中提高两次之间的延时至3秒'
}, {
	version: '20221001_01',
	desc: '修复：适配探索地图界面变化'
}, {
	version: '20221009_01',
	desc: '新增：定时任务；\n新增：结界寄养\n功能由@horsemi提供，感谢大佬的支持'
}, {
	version: '20221012_01',
	desc: '优化：结界寄养等相关功能'
}, {
	version: '20221015_01',
	desc: '修复：悬赏重复执行时中途停止的问题；\n修复：部分功能无法识别庭院与探索地图界面；\n修复：伊吹之擂'
}, {
	version: '20221022_01',
	desc: '优化：修复登录页识别失败问题，添加对一打开菜单的庭院识别；\n优化：式神寄养添加自动寄养开关'
}, {
	version: '20221024_01',
	desc: '优化：修复式神寄养无法识别第二个可用坑位，添加返回庭院方案；\n优化：优化登录方案，添加关闭广告功能；\n修复：式神寄养无法识别第二个可用坑位；\n新增：返回庭院方案。'
}, {
	version: '20221029_01',
	desc: '优化：区域点击的随机坐标生成更加更人性化，且不同设备的偏向坐标不同'
}, {
	version: '20221031_01',
	desc: '新增：qq推送机器人osp上线，使用方法见https://zzliux.cn/assttyys-osp-usage/'
}, {
	version: '20221103_01',
	desc: '优化：已有功能中只要包含脚本停止的内容均可通过osp进行推送'
}, {
	version: '20221109_01',
	desc: '优化：地鬼打完后退出至探索地图界面；\n优化：进入探索地图界面功能中新增从组队界面退出的操作（针对关闭buff方案在组队打完后不会进行任何操作进行优化）'
}, {
	version: '20221110_01',
	desc: '修复：因ui变化导致的金币妖怪与悬赏运行时的部分功能执行异常问题，由aiou大佬提交'
}, {
	version: '20221115_01',
	desc: '新增：狩猎战、道馆挑战方案（horsemi大佬提交）；\n优化：式神寄养，延长响应时间（horsemi大佬提交）；\n新增：六道萤草'
}, {
	version: '20221115_02',
	desc: '优化：六道萤草装buff时偶尔出现点不上的情况增加重试机制，选buff时刷新体验'
}, {
	version: '20221115_03',
	desc: '优化：六道萤草4buff齐后再装buff等'
}, {
	version: '20221117_01',
	desc: '优化：六道萤草：新增统计与推送'
}, {
	version: '20221119_01',
	desc: '优化：使用官方MlkitOcr代替YunxiOcr，优化兼容性与识别性能（需更新壳程序）；\n优化：式神寄养添加关联应用关闭功能。\n'
}, {
	version: '20221119_02',
	desc: '优化：六道萤草各场景延时，提高整体连贯性'
}, {
	version: '20221120_01',
	desc: '修复：六道萤草挂机局数设置为0时只打一局的bug'
}, {
	version: '20221122_01',
	desc: '优化：六道萤草增加宁息商店购买buff，需开启ocr扩展，启用功能206'
}, {
	version: '20221123_01',
	desc: '优化：六道萤草宁息够买buff由ocr识别修改为多点找色；\n修复：六道萤草选buff只刷新一次就直接选buff的bug'
}, {
	version: '20221125_01',
	desc: '新增：活动方案化四季_小怪、化四季boss'
}, {
	version: '20221130_01',
	desc: '修复：探索因UI界面变化导致功能失效的问题'
}, {
	version: '20221130_02',
	desc: '优化：六道萤草选buff支持修改选择buff的优先级（仅能修改内置优先级）；\n优化：适配六道萤草宁息刷新的二次确认；\n优化：六道萤草增加进入装buff界面的延迟'
}, {
	version: '20221202_01',
	desc: '尝试修复：六道萤草不装buff的bug'
}, {
	version: '20221203_01',
	desc: '尝试修复：六道萤草开新局时计数与计次不重置的问题'
}, {
	version: '20221204_01',
	desc: '尝试修复：六道萤草不装buff的bug'
}, {
	version: '20221204_02',
	desc: '尝试修复：六道萤草开新局时计数与计次不重置的问题'
}, {
	version: '20221208_01',
	desc: '修复：调整式神寄养方案，寮活动方案与登录方案，适配新版本（horsemi）'
}, {
	version: '20221210_01',
	desc: '代码重构：请及时反馈使用问题！！'
}, {
	version: '20221210_02',
	desc: '修复：ocr无法使用的问题；\n修复：部分功能无法配置；\n优化：保存方案后自动设置为待运行方案'
}, {
	version: '20221210_03',
	desc: '新增：退出结算可配置再次进攻；\n新增：9退4的突破卡级方案'
}, {
	version: '20221210_04',
	desc: '新增：夜行荒河活动耗时挂机'
}, {
	version: '20221211_01',
	desc: '修复：定时任务不运行方案的bug'
}, {
	version: '20221211_02',
	desc: '新增：悬浮截图按钮'
}, {
	version: '20221213_01',
	desc: '修复：修复全局变量没清空问题；\n优化：狩猎战方案；\n优化：支持多个调度任务同时启用'
}, {
	version: '20221215_01',
	desc: '新增：六道萤草_唤息，老用户需手动开启，将207排序在204前；\n优化：六道萤草_选buff时若xx加成大于等于两个时不刷新（省金币）'
}, {
	version: '20221221_01',
	desc: '新增：活动方案`镜守云归_雪寺匿踪`；\n尝试修复：探索不打boss'
}, {
	version: '20221222_01',
	desc: '修复：御魂御灵挑战无法挑战觉醒的问题；\n修复：镜活动卡结算的问题'
}, {
	version: '20221223_01',
	desc: '修复：六道萤草唤息会点两次的问题'
}, {
	version: '20221227_01',
	desc: '新增：六道萤草极评分时自动使用万相赐福'
}, {
	version: '20221228_01',
	desc: '新增：破魔伏诛挑战'
}, {
	version: '20221229_01',
	desc: '修复：功能502进入探索地图界面中御魂与觉醒界面无法退出来的bug'
}, {
	version: '20230104_01',
	desc: '优化：逢魔新增首领挑战功能（老用户需手动启用）；\n修复：结界寄养部分bug'
}, {
	version: '20230105_01',
	desc: '优化：重构调度任务'
}, {
	version: '20230107_01',
	desc: '优化：绿标在准备前若未识别到别名不会强行卡着无法准备(5秒超时)；\n优化：绿标在查找文本时先进行战斗场景的判断，解决战斗完成后因绿标查找浪费时间；\n优化：六道萤草选buff界面增加500ms的二次判断；\n优化：宁息界面由300ms的二次判断增加至1000ms；\n优化：唤息时先判断是否有宁息，在没有宁息的前提下才会唤息；\n优化：自动任务持久化，不用每次启动程序后手动打开自动任务。'
}, {
	version: '20230114_01',
	desc: '优化：寄养翻页逻辑，加快过滤速度；\n修复：寮突破未加载完成时翻页问题；\n优化：调度任务中切换方案不触发调度任务的结束，直到手动/自动停止才触发调度任务的结束',
}, {
	version: '20230116_01',
	desc: '新增：切换式神预设方案；\n优化：地鬼挑战自动转为普通模式；\n优化：结界寄养适配问题。',
}, {
	version: '20230117_01',
	desc: '新增：月烬宵宴_伴星歌方案；\n优化：寮活动中添加对当天活动的判断行为；\n优化：调度任务超过30分钟后不执行'
}, {
	version: '20230128_01',
	desc: '新增：月烬宵宴_伪月落方案；\n优化：方案页增加分组筛选'
}, {
	version: '20230128_02',
	desc: '优化：功能页、定时任务页中的方案选择器增加分组筛选'
}, {
	version: '20230130_01',
	desc: '新增：寮活动退治、阴界之门、狭间暗域；\n新增：抢寮预祝；\n修复：逢魔boss结算时点击头像问题；\n优化：结界寄养翻页后点错结界卡的问题；\n优化：登录时无响应点击等待'
}, {
	version: '20230204_01',
	desc: '优化：调度任务添加优先级逻辑；\n修复：狭间暗域关闭弹窗的问题'
}, {
	version: '20230205_01',
	desc: '优化：悬赏与金币妖怪部分界面重新取色，优化识别'
}, {
	version: '20230207_01',
	desc: '优化：悬赏与金币妖怪部分界面重新取色，优化识别',
}, {
	version: '20230207_02',
	desc: '修复：收藏/取消方案时会导致该方案重置的问题'
}, {
	version: '20230210_01',
	desc: '新增：喂猫喂狗方案；\n新增：调度任务支持cron表达式配置；\n优化：式神寄养时自动领取奖励；\n'
}, {
	version: '20230211_01',
	desc: '修复：调度任务使用cron时的问题；\n优化：宴会改版适配（摆烂）;\n优化：喂猫喂狗适配'
}, {
	version: '20230212_01',
	desc: `优化：探索时不强制打开轮换；
优化：探索的打掉落加成增加色组，优化识别率；
优化：绿标文本时点击的坐标稍微下移几个像素；
优化：退出结算点击区域调整（仅针对左上角贪吃鬼图标场景调整）；
优化：道馆挑战时点击挑战图标时增加1秒的等待防止点击过早弹出排名列表；
优化：宴会增加轮换配置逻辑；
优化：狭间暗域打首领与小怪的优先级
`
}, {
	version: '20230213_01',
	desc: '修复: 阴阳寮获取体力金币bug；'
}, {
	version: '20230213_02',
	desc: `修复：御魂挑战在战斗界面时触发3次停止脚本；
优化：退出结算时将贪吃鬼图标的优先级提到最高；
优化：御魂挑战喂猫增加适配。
`
}, {
	version: '20230215_01',
	desc: `新增：贪食鬼吃御魂方案；
新增：奉纳御魂。
`
}, {
	version: '20230215_02',
	desc: '修复：游戏更新导致准备功能无法从手动切换为自动'
}, {
	version: '20230216_01',
	desc: `新增：从式神录进入御魂界面；
优化：“突破_9退4_进攻”可识别到攻打第一排第一列结界则切换方案；
优化：隐藏了历史活动`
}, {
	version: '20230219_01',
	desc: '优化：六道莹草buff统计使用获得奖励界面统计（手选buff与开箱子buff均能统计进来了），需启用208'
}, {
	version: '20230219_02',
	desc: '修复：退出结算使用左上角贪吃鬼图标判时的计次错误的问题'
}, {
	version: '20230220_01',
	desc: '优化：拆分寮活动方案逻辑，添加拆分后的定时任务与方案'
}, {
	version: '20230221_01',
	desc: `新增：“奉纳结束后会返回式神录”
新增：“绘卷进度检测”方案。
新增：“2_退出结算”功能加入识别体力不足。
修复：奉纳御魂osp推送。
优化：“503_返回庭院界面”可从式神录界面返回
优化：悬浮按钮的主页键删除。
`
}, {
	version: '20230221_02',
	desc: '修复：“9 结界_勋章点击”运行报错的问题。'
}, {
	version: '20230223_01',
	desc: `尝试修复：退出结算时点击到加成的问题；
优化：“502_进入探索地图界面”中组队邀请确认可点击取消`
}, {
	version: '20230223_02',
	desc: '修复：修改方案名、排序等操作会重置已修改过的方案的问题'
}, {
	version: '20230223_03',
	desc: `新增：活动方案鬼城岐事及相关功能；
优化：夜行荒河适配本次活动`
}, {
	version: '20230225_01',
	desc: '优化：重置方案支持重置单个方案（仅内置方案）'
}, {
	version: '20230226_01',
	desc: `新增：306邀请好友功能；
优化：27组队匹配修改为组队创建队伍或匹配
优化：501打开buff界面支持从组队界面内打开
优化：4接受邀请支持切换方案`
}, {
	version: '20230227_01',
	desc: `优化/修复：304绘卷检测问题
修复：接受邀请导致退出结算计数异常的问题`
}, {
	version: '20230301_01',
	desc: '新增：活动方案决裂庭院'
}, {
	version: '20230303_01',
	desc: `优化：CRON定时任务逻辑修改：表达式用于解析下次运行时间，调度时根据下次运行时间进行判定，请使用CRON表达式定时任务的同学手动编辑一下重复间隔用于重新解析下次运行时间；
尝试修复：个人突破点头像的问题；
新增：内置组队循环示例方案
`
}, {
	version: '20230304_01',
	desc: `修复：个人突破报错的问题
新增：庭院进入斗技、探索地图进入每周挑战秘闻功能
优化：开启buff简化配置`
}, {
	version: '20230304_02',
	desc: `优化：悬赏进入副本识别，应该不会打睡猪8了，如果还有碰到进入高难度机制本请截图反馈，加大庭院打开悬赏弹窗的识别范围，可以使用高个子式神了
修复：庭院悬赏弹窗在所有任务完成的情况下卡在弹窗那里。现在庭院悬赏弹窗页面如果所有任务已经完成会关闭弹窗后停止脚本，也可在42功能里设置执行下一个方案`
}, {
	version: '20230305_01',
	desc: `新增：3悬赏支持仅接勾协
优化：302奉纳支持三排的神眷`
}, {
	version: '20230306_01',
	desc: `尝试修复：个人突破点头像的问题；
尝试修复：不接勾协的问题；
优化：功能993取消包名配置，修改为读取设置中的关联应用`
}, {
	version: '20230306_02',
	desc: `优化：52悬赏_打开悬赏界面支持与完整的悬赏方案一起使用而不冲突（放在功能29前），原功能不受影响
优化：52兼容悬赏图标“√”时打开悬赏界面
优化：48悬赏杂项支持刷新记录提示的关闭`
}, {
	version: '20230308_01',
	desc: `妇女节快乐！！😘😘😘 优化：个人突破支持呱太；
优化：调度任务修改为10秒获取一次调度状态；CRON定时任务在启动程序时自动更新下次运行时间；
优化：式神寄养流程；
修复：寮活动空对象访问。
`
}, {
	version: '20230308_02',
	desc: '优化：六道萤草装buff时重置按钮增加延迟'
}, {
	version: '20220310_01',
	desc: '新增：强化御魂方案'
}, {
	version: '20220310_02',
	desc: `优化：呱太突破增加色组提高兼容性；
优化：强化御魂可选x号位`
}, {
	version: '20230312_01',
	desc: `优化：庭院进入探索低画质适配；
优化：寄养翻页；
优化：添加悬赏定时任务；
优化：脚本停止时的提示内容包含已执行的方案。`
}, {
	version: '20230312_02',
	desc: '优化：悬赏兼容左上角有“拓”或“宠”的情况'
}, {
	version: '20230314_01',
	desc: `新增：310暴食鬼吃经验书；
优化：309强化御魂当页结束后修改为翻页，而不是退出重进；
优化：30斗技支持到指定段位后停止脚本；
优化：27创建组队时默认选择不公开；
优化：203六道萤草在挑战boss失败后放弃挑战
修复：306组队邀请好友在识别不出好友时报错的问题；
修复：52悬赏“√”识别不到的问题；
修复：43悬赏神秘妖怪报错的问题。
`
}, {
	version: '20230315_01',
	desc: '优化：进入逢魔，斗技方式，找色调整为多点比色，添加首领进入式神录适配'
}, {
	version: '20230321_01',
	desc: `优化：51绿标勾选准备时查找坐标时，固定坐标也同时生效；
优化：993启动游戏前判断是否庭院，如果是庭院则不启动游戏并直接进行后续逻辑
`
}, {
	version: '20230329_01',
	desc: '优化：添加红标功能，优化公告适配，添加活动 万言归灵方案，优化调度中心，减短补锅时长'
}, {
	version: '20230401_01',
	desc: `优化：27创建组队在体力不够时自动停止（点击3次未开始）
优化：7结界3次刷新cd判定时间从30秒修改为5秒
`
}, {
	version: '20230401_02',
	desc: `优化：突破点头像 
优化：组队方案可以被悬浮窗按钮识别
优化：单人探索BUG
优化：组队邀请BUG
增加：每周百鬼奕
增加：言灵对弈活动
`
}, {
	version: '20230403_01',
	desc: `修复：突破0勋章持续点击 
优化：探索退出延时增加
`
}, {
	version: '20230401_03',
	desc: '修复：突破勋章点击(如任无法识别可更改找色为96)'
}, {
	version: '20230404_01',
	desc: '修复：cron调度任务跨月时间更新错误/未更新的问题'
}, {
	version: '20230405_01',
	desc: '新增：众言归一活动'
}, {
	version: '20230405_02',
	desc: '优化：多点找色相关色组修改对齐方向'
}, {
	version: '20230405_03',
	desc: '优化：逢魔挑战中若查找10次首领仍未进入挑战择将直接标记为已挑战boss'
}, {
	version: '20230406_01',
	desc: '优化：探索可及时识别boss'
}, {
	version: '20230406_02',
	desc: '优化：兼容部分无法识别已展开菜单的庭院'
}, {
	version: '20230407_01',
	desc: '修复：503返回庭院界面功能报错'
}, {
	version: '20230407_02',
	desc: '修复：509进入式神录无反应'
}, {
	version: '20230409_01',
	desc: '修复：508逢魔首领查找到boss后不打boss的bug'
}, {
	version: '20230409_02',
	desc: '修复：自动任务id可能重复的问题（历史的id若有重复需删除后新增，或手工修复数据）'
}, {
	version: '20230416_01_dev',
	desc: `优化：ui界面使用vue3重构，方案列表页在横屏下显示2列，自动记录滚动条位置。
修复：体服六道莹草在选阵容的莹草界面不点击确定的问题`
}, {
	version: '20230423_01',
	desc: `新增：30斗技杂项支持逐原之争；
优化：51绿标新增参数偏移；
优化：19百鬼夜行选择鬼王挑战后延时从6秒增加至9秒；
修复：删除方案后无法进入其它方案;`
}, {
	version: '20230424_02',
	desc: '优化：508逢魔增加逢魔极，修复首领退治bug退治成功后识别失败，优化红标功能(可以耍了)，优化寮活动翻页功能(需要重置方案《庭院进入寮每日活动》)'
}, {
	version: '20230426_01',
	desc: '新增：爬塔活动妖塔燃战'
}, {
	version: '20230416_02',
	desc: '修复：逢魔密信报错'
}, {
	version: '20230427_01',
	desc: '新增：重启模拟器方案与定时任务；修复：逢魔·极挑战弹窗适配'
}, {
	version: '20230501_01',
	desc: '修复：311红标 默认参数修改为自定义坐标，之前有使用红标的伙伴请修改一下红标的参数，另外，劳动节快乐哦，我在家里也很快乐 : )'
}, {
	version: '20230501_02',
	desc: '优化：强化退出结算等点击时的用户特征'
}, {
	version: '20230502_01',
	desc: '优化：六道萤草增功能209神秘之屿转换，请手动在六道萤草方案中启用该功能。'
}, {
	version: '20230503_01',
	desc: '修复：六道萤草转换成功后不点击的问题'
}, {
	version: '20230506_01',
	desc: `新增：夏日游园会_消消乐
修复：地鬼卡在筛选的界面
尝试修复：六道萤草在没有可转换的时候卡住的问题
优化：关于界面查看版本历史修改为倒序`

}, {
	version: '20230506_02',
	desc: `尝试修复：不接勾协(如果影响主体方案请关闭"只接勾协")
优化：夏日游园会_消消乐可自动退出与推送，有需要的同学请手动开启`
}, {
	version: '20230507_01',
	desc: '尝试修复：消消乐因识别关卡退出的情况'
}, {
	version: '20230508_01',
	desc: `修复：部分设备狩猎战不进的问题；
修复：寮活动翻页的问题`
}, {
	version: '202305012_01',
	desc: `修复:妖气封印
优化:结算退出可识别经验副本
优化:结界三次刷新增加"无法九胜时才三次刷新开关`
}, {
	version: '20230515_01',
	desc: `新增：方案和功能可搜索，并记录搜索位置；
新增：ocr插件YunxiOcr；
优化：启动游戏相关内置方案增加503功能，降低重启游戏的可能性；
优化：503返回庭院增加对突破界面的识别；
`
}, {
	version: '20230516_01',
	desc: `修复：未进入设置页ocr使用异常的问题
优化：993/503功能增加关闭更新提醒弹窗
优化：启动游戏相关内置方案增加1和2功能，降低重启游戏的可能性；
优化：生成的点击坐标更加的服从正态分布`
}, {
	version: '20230517_02_dev',
	desc: `新增：定时任务添加免打扰模式；
新增：活动方案宴场维和及相关功能；
修复：510未配置时导致511不翻页的问题；
优化：定时任务页面，代码重构；
优化：六道萤草重置buff数量的逻辑`
}, {
	version: '20230522_01',
	desc: `新增：定时任务-启动游戏-每日签到与收取邮件；
修复：复制和修改方案后无法进入方案的bug；
修复：2退出结算在MuMu模拟器下点击奖励的问题；
修复：搜索清空后重进又恢复的问题;
优化：贝塞尔滑动降低偏离幅度；
优化：50开启buff找不到时会翻一次页;
优化：503增加“获取称号”的适配；
优化：503增加道馆突破返回上一级；
优化：名仕不参与斗技；
优化：定时任务timer重构；`
}, {
	version: '20230523_01',
	desc: `更新：呱太3次刷新比色点 
更新：开启被遮挡的御魂BUFF判定
恢复：返回庭院的突破识别并返回
修改：删除并更改百鬼奕功能
优化：进入式神录取点，防止转方案弹窗覆盖比色点`
}, {
	version: '20230524_01',
	desc: `尝试修复：被高优先级打断的定时任务不恢复执行的问题；
优化：503返回庭院增加战斗场景识别退出；
优化：131宴场维和挑战增加2s延时；`
}, {
	version: '20230525_1',
	desc: `优化：16地鬼挑战适配体服20230524更新探索地图进入地鬼位置变化；
优化：308进入秘闻适配20230524体服更新秘闻入口图标位置变化；
优化：503返回庭院识别战斗场景后不操作，仅等待；
`
}, {
	version: '20230526_01',
	desc: '新增：推送支持OneBot，自建机器人可参考`https://github.com/lc-cn/onebots`'
}, {
	version: '20230527_01',
	desc: `修复：302奉纳御魂问题
优化：002体力不够后切换方案的延迟
优化：306组队邀请多次不被接受就停止
`
}, {
	version: '20230528_01',
	desc: `优化：返回定时任务界面时自动更新界面数据
修复：3中仅接受勾协、7中无法九胜时才三次刷新、306中邀请的是第二名好友（是否是三人组队）、510中快速坐标模式配置初始值错误问题
修复：OneBot推送错误的问题`
}, {
	version: '20230530_01',
	desc: `优化：516寮活动翻页增加结束后不执行任何操作选项；
优化：993应用启动登录皮肤广告识别错误的问题；
`
}, {
	version: '20230531_01',
	desc: '新增：恋色障道（放在了宴场维和里面）'
}, {
	version: '20230605_01',
	desc: '修复推送类型为ospPush时无法推送的问题'
}, {
	version: '20230611_01',
	desc: `新增：契灵;
修复：510式神录预设过滤与2退出结算冲突的问题;
优化：993应用登录支持同区多账号`
}, {
	version: '20230614_01',
	desc: `新增：寄养更换结界卡功能;
修复：518自动签到无法领取签到奖励;`
}, {
	version: '20230616_01',
	desc: '优化：998换狗粮逻辑，优化518御魂已满情况'
}, {
	version: '20230617_02_dev',
	desc: `修复：适配新契灵；
优化：40关闭buff，50开启buff增加点击后延时(fix #12)`
}, {
	version: '20230618_01',
	desc: '优化：050开启buff可在准备界面下开启/040关闭buff可在准备界面下关闭，需手动配置'
}, {
	version: '20230618_02',
	desc: '优化：多个好友邀请的逻辑（影响现有的方案）'
}, {
	version: '20230622',
	desc: `修复：契灵石头召唤后即使相同契灵也会换预设
优化：精简了通用活动`
}, {
	version: '20230622_01',
	desc: '优化：通用活动识图范围'
}, {
	version: '20230624_01',
	desc: '优化：518 添加领取友情点与商店每日领取'
}, {
	version: '20230626_01',
	desc: `优化：组队306邀请速度
修复：998寄养时有招财上宾时会卡体力食盒的问题`
}, {
	version: '20230627',
	desc: '增加：314领取花合战功能'
}, {
	version: '20230628_01',
	desc: '新增：活动森间试炼'
}, {
	version: '20230628_02',
	desc: '优化：312通用活动，现在可以自行设置点击区域'
}, {
	version: '202306230_01',
	desc: '优化：账号被顶会停止脚本'
}, {
	version: '20230701_01',
	desc: '优化：518添加适配好友羁绊与商店热卖'
}, {
	version: '20230706_01',
	desc: '新增：邀约悬赏（在3悬赏协作配置，默认为自动关闭）'
}, {
	version: '20230706_02',
	desc: '修复：邀约协作'
}, {
	version: '20230707_01',
	desc: '优化：998添加 低星结界卡适配'
}, {
	version: '20230708_01',
	desc: '优化：定时任务添加狭间，优化506，去除自动配置'
}, {
	version: '20230712_01',
	desc: '优化：993同区多账号添加账号序号功能，优化寄养，狩猎 找色方案'
}, {
	version: '20230712_02',
	desc: '优化：993登录游戏关闭看CG的提示'
}, {
	version: '20230712_03',
	desc: '优化：45、44强化适配'
}, {
	version: '20230713_01',
	desc: '增加：315功能,战斗前换预设阵容'
}, {
	version: '20230714_01',
	desc: `优化:315改为每次方案只换一次
修复:组队邀请范围
修复:多次领取花合战`
}, {
	version: '20230716_01',
	desc: `修复：518 993适配
优化：508逢魔首领 极 的逻辑`
}, {
	version: '20230718_01',
	desc: '优化：执行方案时增加延时，避免误识别'
}, {
	version: '20230719_01',
	desc: `优化：安卓12+ + root环境增加设置选项：允许不受信任触摸的事件穿透
优化：安卓10+ + 有无障碍环境申请截图权限时自动点击“立即开始”`
}, {
	version: '20230719_02',
	desc: '优化：503返回庭院不识别探索地图界面'
}, {
	version: '20230723_01',
	desc: `新增：六道椒图
优化：增加点击后延时基数`
}, {
	version: '20230726_01',
	desc: '优化：统一庭院识别 优化338逻辑，增加对前往寄养弹窗适配'
}, {
	version: '20230726_02',
	desc: '新增：守缘合战',
}, {
	version: '20230731_01',
	desc: `新增：经验妖怪，年兽，开启金币buff_金币妖怪，
	更新：金币妖怪方案（请重置金币妖怪方案）
	优化：寄养 斗鱼适配`,
}, {
	version: '20230803_01',
	desc: `修复：金币，经验妖怪方案无法创建队伍（请重置金币，经验妖怪方案）
	优化：每日签到好友弹窗逻辑(有倒霉蛋被封神榜了，很冤，因此大家为他默哀1分钟吧)`,
}, {
	version: '20230803_02',
	desc: `更新：强化御魂
	优化：隐藏历史活动`,
}, {
	version: '20230818_01',
	desc: `优化：强化御魂,进步不够就停止
	修复：六道椒图卡在商店`,
}, {
	version: '20230821_01',
	desc: `修复：六道椒图商店不返回
	修复:邀请好友`,
}, {
	version: '20230823_01',
	desc: `新增：活动_真火切磋；
尝试修复：自动识别的偶现报错问题`
}, {
	version: '20230825_01',
	desc: '修复：通用活动关闭ocr模式, 增加点击超时关闭'
}, {
	version: '20230827_01',
	desc: '修复：逢魔答题闪退的问题'
}, {
	version: '20230901_01',
	desc: `修复:花合战多次领取
	修复:开始绿标功能时不实行手动切换自动
	修复:强化御魂无法正常进行
	`
}, {
	version: '20230902_01',
	desc: '新增: gotify推送方式'
}, {
	version: '20230902_02',
	desc: '新增: pushplus推送方式'
}, {
	version: '202309014_01',
	desc: '优化:六道椒图, 修复：商店样式更新'
}, {
	version: '202309020_01',
	desc: '增加:破晓之时(自行筹齐5个谎言再开启,方案只会乱点关卡和放弃)'
}, {
	version: '20230923_01',
	desc: '优化：破晓之时：开局时自动选谎言式神，若开局无法存在无谎言可选时将停止脚本；遗物自动选择游走的雷光。'
}, {
	version: '20230927_01',
	desc: '修复：庭院加成图标，修复庭院未展开菜单适配'
}, {
	version: '20230929_01',
	desc: '修复：修复庭院已展开菜单适配'
}, {
	version: '20230929_02',
	desc: `优化：寄养功能，增加空结界列表适配能力
	优化 红标逻辑，增加PVEBOSS血条红标功能
	优化 宴会 增加添加狗粮逻辑
	优化 狭间 减少首领挑战次数`
}, {
	version: '20231016_01',
	desc: '修复：椒图柔风计数'
}, {
	version: '20231018_01',
	desc: '优化：02退出结算增加参数“小区域点击”，用于解决掉落过多时点击错误的问题'
}, {
	version: '20231026_01',
	desc: `优化:51绿标,准备后先识别是否有绿标(道馆需求)(需开启功能51内的准备前查找坐标选项)
	优化:1准备后延时时间
	修复:316椒图柔风计数,需重置方案或者手动把功能316移至功能2前`
}, {
	version: '20231109_01',
	desc: `修复:51绿标天照被突破buff遮挡问题
	删除了317破晓之时活动`
}, {
	version: '20231115_01',
	desc: '修复：993增加关闭广告误触兜底方案'
}, {
	version: '20231120_01',
	desc: '修复：返回庭院'
}, {
	version: '20231205_01',
	desc: `优化：993适配应用宝登录时的公告界面关闭；
优化：关联启动应用时显示应用版本号`
}, {
	version: '20231214_01',
	desc: '修复：16地鬼点错筛选，卡挑战界面不返回'
}, {
	version: '20231222_01',
	desc: '新增：超鬼王'
}, {
	version: '20231222_02',
	desc: '修复：因地鬼筛选页新增悬赏页签导致热门挑战失效'
}, {
	version: '20231223_01',
	desc: '新增：318_星灭切换'
}, {
	version: '20230106_01',
	desc: '新增:319_缘结趣游和方案'
}, {
	version: '20240119_01',
	desc: '优化：导出的方案删除不必要的信息'
}, {
	version: '20240205_01',
	desc: '优化：狭间暗域添加boss挑战顺序选项'
}, {
	version: '20240205_02',
	desc: `优化：037组队适配1.7.66+
优化：经验妖怪、金币妖怪的启动与执行方案，在准备界面中开启buff，而不是在庭院就开；
优化：经验妖怪、金币妖怪组队的ocr识别；
优化：开启buff、关闭buff的默认配置，开启buff默认不切换方案，关闭buff下一个方案默认值为返回庭院；
`
}, {
	version: '20240205_01',
	desc: '适配1.7.66+的游戏客户端发布正式'
}, {
	version: '20240208_01',
	desc: '修复：道馆适配问题'
}, {
	version: '20240210_01',
	desc: `龙年大吉！
优化: 401庭院进入对弈竞猜的取色与逻辑`
}, {
	version: '20240215_01',
	desc: '修复: 对弈竞猜图标倒计时后查找不到的问题'
}, {
	version: '20240217_01',
	desc: `优化：悬赏出现寮公告后不影响识别；
优化：993调整为10秒内脚本自身未执行任何操作才重启关联应用`
}, {
	version: '20240219_01',
	desc: '优化：308适配秘闻挑战开启按钮'
}, {
	version: '20240225_01',
	desc: '优化：ocr找字的模糊匹配相似度修改为0.7(原0.5)，且字符串对比的相似度加入了字形计算因子'
}, {
	version: '20240227_01',
	desc: '修复：mumu12平板模式（横屏时）加载脚本无响应的问题'
}, {
	version: '20240301_01',
	desc: `优化：511在503前且在式神录界面时优先执行503；
修复：OCR找字部分情况下使用模糊匹配时相似度仍然为0.5的问题（应该为0.7）`
}, {
	version: '20240303_01',
	desc: '优化：316六道椒图大幅提高选事件的效率'
}, {
	version: '20240306_01',
	desc: '优化：32道馆挑战增加失败投票'
}, {
	version: '20240308_01',
	desc: '新增：集音'
}, {
	version: '20240312_01',
	desc: '优化：六道椒图'
}, {
	version: '20240322_01',
	desc: `优化：六道椒图失败自动放弃
优化：战斗界面强化适配
`
}, {
	version: '20240423_01',
	desc: `增加：内置方案“返回上一个方案”，现用于更好的结界逻辑
优化突破循环,需要重置,现在只需一个退出方案
503增加一些界面
509进入后延迟一秒，防止卡顿，并且增加了误触进情报的界面
增加僵尸寮道馆方案
删除弃置功能
40,50增加id
319修复和优化
结界增加自动
314尝试修复每月更新界面
501增加开关`
}, {
	version: '20240428_01',
	desc: '新增：杀应用方式支持root或android api两种模式（原仅支持root）'
}, {
	version: '20240518_01',
	desc: '优化：修改寮活动翻页逻辑：由上下滑动修改为上滑动后返回上一级'
}, {
	version: '20240519_01',
	desc: '新增：定时任务支持随机时间偏移'
}, {
	version: '20240523_01',
	desc: '优化：002退出结算支持关闭结界卡上限提示'
}, {
	version: '20240529_01',
	desc: '修复：20240529更新后组队界面不识别的问题'
}, {
	version: '20240530_01',
	desc: '新增：定时任务队列快捷清单'
}, {
	version: '20240606_01',
	desc: '修复：518无限切换吉闻与友情点、商店跳过热门推荐动画、礼包屋不退回庭院。'
}, {
	version: '20240607_01',
	desc: '优化：518进入商店关闭扩展包弹窗',
}, {
	version: '20240607_02',
	desc: '修复：启动过无下次执行时间的定时任务启动报错的问题',
}, {
	version: '20240608_01',
	desc: '修复：518领完黑蛋回不回庭院',
}, {
	version: '20240610_01',
	desc: '优化：点击后的延时区间由线性随机修改为服从正态分布的随机'
}, {
	version: '20240627_01',
	desc: '优化：016地鬼结束支持切换方案'
}, {
	version: '20240627_02',
	desc: `优化：508逢魔首领结束支持切换方案
002退出结算对取消确认框额外判断是否已勾选`
}, {
	version: '20240629_01',
	desc: `优化：内置方案允许删除；
修复：修改了公共配置参数的延时相关参数引起的不正常延时`
}, {
	version: '20240629_02',
	desc: '优化：内置方案允许删除，找回可通过创建同名内置方案后并重置该方案即可'
}, {
	version: '20240701_01',
	desc: '优化：30斗技、503返回庭院支持巅峰斗技'
}, {
	version: '20240702_01',
	desc: '优化：30斗技、503返回庭院支持巅峰斗技段位保护'
}, {
	version: '20240703_01',
	desc: '修复：508逢魔首领不进夜荒魂；优化508/026逢魔挤车相关延时与点击次数'
}, {
	version: '20240707_01',
	desc: '优化：503返回庭院允许配置可处理的界面，使用了503功能的方案建议重新保存一下'
}, {
	version: '20240710_01',
	desc: '修复：02退出结算结界卡上限与再次挑战的确认框冲突'
}, {
	version: '20240711_01',
	desc: '优化：六道椒图升级增加兼容取点'
}, {
	version: '20240713_01',
	desc: '优化：名士斗技兼容巅峰赛',
}, {
	version: '20240718_01',
	desc: '增加:活动肉鸽'
}, {
	version: '20240727_01',
	desc: '修复：518增加头像界面返回，518好友能从‘最近’切换至‘好友’'
}, {
	version: '20240804_01',
	desc: '修复：六道椒图卡商店，重新取色'
}, {
	version: '20240805_01',
	desc: '修复：六道椒图卡商店，重新取色'
}, {
	version: '20240807_01',
	desc: '优化：强化适配逢魔首领'
}, {
	version: '20240814_01',
	desc: '新增：答题活动'
}, {
	version: '20240814_02',
	desc: '优化：答题活动多次点击开始未进入则停止脚本'
}, {
	version: '20240818_01',
	desc: '优化：答题活动的题库搜索修改为基于字形相似度的编辑距离计算'
}, {
	version: '20240822_01',
	desc: '修复：极逢魔首领挑战界面错误的问题'
}, {
	version: '20240824_01',
	desc: `优化：016地鬼热门挑战修改为热门收藏挑战，可手动修改为挑战收藏的鬼王；
修复：设置无法修改关联应用停止模式；
优化：onebot推送新增参数图片缩放大小；
`
}, {
	version: '20240825_01',
	desc: '修复：狭间报错Cannot convert undefined to an object.'
}, {
	version: '20240901_01',
	desc: '优化：013在探索章节界面从普通切换困难前判断是否为普通，而非原来的无脑切换'
}, {
	version: '20240903_01',
	desc: `优化：契灵盘子上限弹窗；
	组队增加关闭误触好友弹窗；
	更改了306邀请好友逻辑增加了速度和永生之海，现可把邀请和组队过程整合至一个方案（更多逻辑查看手册）；
	004功能对邀请提示不做动作增加了稳定性代码（先返回庭院）
	27功能可自选副本
	993不强制ocr，增加是否切换方案开关`
}, {
	version: '20240904_01',
	desc: '适配新的探索地图界面',
}, {
	version: '20240904_02',
	desc: '002退出结算适配阴阳师/英杰技能升级提示'
}, {
	version: '20240905_01',
	desc: '修复002退出结算适配阴阳师/英杰技能升级提示'
}, {
	version: '20240905_02',
	desc: '优化：993启动游戏登陆页的取点，屏蔽的无响应弹窗的识别操作'
}, {
	version: '20240906_01',
	desc: '优化：993启动游戏中关闭弹窗的误识别；\n修复：013点击困28坐标偏移'
}, {
	version: '202409012_01',
	desc: '增加：活动_麻将（一把期望是10局，低效率，能接受再刷）'
}, {
	version: '202409012_01',
	desc: `增加：悬浮窗启动是否伴随着启动应用(设置里开启)；
	定时任务现在会直接启动游戏；
	常驻悬浮窗方案代码，（通用活动和月常活动已常驻悬浮窗按钮内）；
	993跳过开屏zen的动画；
	修复：304绘卷提醒；`
}, {
	version: '202409012_01',
	desc: `优化：311大花更改为标腐血或神荒单位
519道馆增加打不过馆主主动放弃
修复：313进入契灵错误
993启动游戏关闭太敏感`
}, {
	version: '202409012_01',
	desc: '优化：519道馆ocr识别效率'
}, {
	version: '20241001_01',
	desc: '401对弈竞猜适配'
}, {
	version: '20241001_02',
	desc: '401对弈竞猜修复失败后不操作的bug'
}, {
	version: '20241002_01',
	desc: '401对弈竞猜修复成功后不操作的bug',
}, {
	version: '20241002_02',
	desc: '401对弈竞猜修复成功后不操作的bug',
}, {
	version: '20241003_01',
	desc: `519日期不生效
	993点击进入游戏加入了延迟`,
}, {
	version: '20241003_02',
	desc: '尝试修复：通过定时任务启动的方案刚启动就被503停止的问题'
}, {
	version: '20241006_01',
	desc: '修复：306跨区邀请失败'
}, {
	version: '20241021_01',
	desc: `修复：519增加人数选项
增加：31可批量合成
优化：启动游戏加入进度条判定`
}, {
	version: '20241121_01',
	desc: '修复：商店点黑蛋'
}, {
	version: '20241125_01',
	desc: '新增：000增加结束后暂停'
}, {
	version: '20241126_01',
	desc: '优化：51和311不生成个别日志'
}, {
	version: '20241128_01',
	desc: '优化：斗技界面部分功能项重新取点'
}, {
	version: '20241203_01',
	desc: `优化：319增加延时
519:识别不到寮资金时用399W代替
增加：app.js文件`
}, {
	version: '202412011_01',
	desc: `整合：301和302，304和305
增加：304_保持95排名
306_首次组队取消锁定阵容
520_宴会筹备
修复：518_礼包屋推荐`
}, {
	version: '202412014_01',
	desc: `已整合悬赏，只需开启018，并增加取消协作选项（需重进方案内开启）
	已整合百鬼夜行，只需开启017（需重进方案内开启）
	删除了六道莹草`
}, {
	version: '20241216_01',
	desc: '新增：支持巅峰s2斗技'
}, {
	version: '20241227_01',
	desc: '增加：协同对弈开始和结算'
}, {
	version: '20241229_01',
	desc: '优化：安卓8+下的拟人滑动更拟人'
}, {
	version: '20241230_01',
	desc: '增加:9突破取消锁定,1战斗主题非简约主题会提示更换'
}, {
	version: '20241231_01',
	desc: '增加：经营活动'
}, {
	version: '20240105_01',
	desc: `修复：悬赏追踪重新取点
	通用活动放宽悬浮窗黄标识别（测试）
	方案选择改为两列`
}, {
	version: '20240118_01',
	desc: '因功能0结束判断的参数“结束当前方案后切换方案”变更为“结束后的操作”，如果有存在方案在功能0中设置过切换方案，需手动重新设置下该功能的新参数“结束后的操作”值为“切换方案”'
}, {
	version: '20250122_01',
	desc: '因透明悬浮的穿透因未知情况失效，恢复设置项“允许不受信任触摸的事件穿透”',
}, {
	version: '202503069_01',
	desc: '修复优化：514狭间暗域',
}, {
	version: '20250313_01',
	desc: '修复优化：32道馆，投票放弃道馆突破',
}, {
	version: '20250316_01',
	desc: `修复优化：503返回庭院界面，增加狭间暗域
	514狭间暗域，打完次数后返回庭院
	515狭间暗域挑战，前往怪物增加延时，避免卡游戏窗口bug`
}, {
	version: '20250316_02',
	desc: `修复优化：514狭间暗域卡结算页bug
	514狭间暗域新增3D人物前往怪物自定义等待时间
	515狭间暗域挑战`
}, {
	version: '20250317_01',
	desc: '修复优化：311红标，更新神荒、腐血取色',
}, {
	version: '20250323_01',
	desc: '新增：500进入寮活动，道馆集结取色',
}];

export default versionList[versionList.length - 1].version;
